Case_file_scdccfoam/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 101325;

boundaryField
{
  Top
  {
    type              totalPressure;
    p0                uniform 101325;
    value             uniform 101325;
  }

  "(Bottom|condWall|convWall|htopWall)"
  {
      type            fixedFluxPressure;
      rho             rhok;
      value           $internalField;
  }

  LSymm
  {
      type            symmetryPlane;
  }

}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
