Case_file_scdccfoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dia         0.2;
in_wid      0.175;
htop        2;
cond        1.83;
conv        1.8;

scale   1;

vertices
(
//Base-Block
    ($in_wid      0     0)       //0
    ($dia         0     0)       //1
    ($dia         $conv 0)       //2
    ($in_wid      $conv 0)       //3
    ($in_wid      0     0.005)   //4
    ($dia         0     0.005)   //5
    ($dia         $conv 0.005)   //6
    ($in_wid      $conv 0.005)   //7
    //inner block beside convection
    (0            0     0)       //8
    (0            $conv 0)       //9
    (0            0     0.005)   //10
    (0            $conv 0.005)   //11
//Conduction-Block
    ($in_wid      $cond 0)       //12
    ($dia         $cond 0)       //13
    ($in_wid      $cond 0.005)   //14
    ($dia         $cond 0.005)   //15
    //inner block beside conduction
    (0            $cond 0)       //16
    (0            $cond 0.005)   //17
//HotTop-Block
    (0            $htop 0)      //18
    ($in_wid      $htop 0)      //19
    (0            $htop 0.005)  //20
    ($in_wid      $htop 0.005)  //21
);

blocks
(
    hex (0 1 2 3 4 5 6 7)           (4  250 1) simpleGrading (1 1 1) //1
    hex (8 0 3 9 10 4 7 11)         (25 250 1) simpleGrading (1 1 1) //2
    hex (3 2 13 12 7 6 15 14)       (4  5 1) simpleGrading  (1 1 1) //3
    hex (9 3 12 16 11 7 14 17)      (25 5 1) simpleGrading  (1 1 1) //4
    hex (16 12 19 18 17 14 21 20)   (25 20 1) simpleGrading  (1 1 1) //5
);

edges
(
);

boundary
(
    Top
    {
        type patch;
        faces
        (
            (18 20 21 19)
        );
    }
    Bottom
    {
        type patch;
        faces
        (
            (1 5 4 0)
            (0 4 10 8)
        );
    }
    htopWall
    {
      type wall;
      faces
      (
        (19 21 14 12)
      );
    }
    condWall
    {
        type wall;
        faces
        (
          (13 15 6 2)
        );
    }
    convWall
    {
        type wall;
        faces
        (
          (2 6 5 1)
        );
    }
    LSymm
    {
        type symmetryPlane;
        faces
        (
            (8 10 11 9)
            (9 11 17 16)
            (16 17 20 18)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)

            (8 9 3 0)
            (10 4 7 11)

            (9 16 12 3)
            (11 7 14 17)

            (3 12 13 2)
            (7 6 15 14)

            (16 18 19 12)
            (17 14 21 20)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
