Case_file_scdccfoam/system/blockMeshDict_3blockCavity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0.0 0.0 0)
    (0.1 0.0 0)
    (0.1 0.47 0)
    (0.0 0.47 0)
    (0.0 0.0 0.005)
    (0.1 0 0.005)
    (0.1 0.47 0.005)
    (0.0 0.47 0.005)

    (0.0 0.5 0)
    (0.1 0.5 0)
    (0.0 0.5 0.005)
    (0.1 0.5 0.005)

    (0.0 0.7 0)
    (0.1 0.7 0)
    (0.0 0.7 0.005)
    (0.1 0.7 0.005)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)       (30 141 1) simpleGrading (1 1 1)
    hex (3 2 9 8 7 6 11 10)     (30 10 1) simpleGrading (1 1 1)
    hex (8 9 13 12 10 11 15 14) (30 60 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    Top
    {
        type patch;
        faces
        (
            (12 14 15 13)
        );
    }

    Bottom
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    htopWall
    {
      type wall;
      faces
      (
        (13 15 11 9)
      );
    }
    condWall
    {
        type wall;
        faces
        (
          (9 11 6 2)
        );
    }
    convWall
    {
        type wall;
        faces
        (
          (2 6 5 1)
        );
    }
    LSymm
    {
        type symmetryPlane;
        faces
        (
            (0 4 7 3)
            (3 7 10 8)
            (8 10 14 12)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (3 8 9 2)
            (7 6 11 10)
            (8 12 13 9)
            (10 11 15 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
