Case_file_scdccfoam/system/blockMeshDict_MCDCC
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
ht          0.6;
dia         0.1;
snctr_wid   0.005;
snctr_ht    0.06;
htop_snctr  0.54;
cond        0.5;
conv        0.4;

scale   1;

vertices
(
//Base-Block
    ($snctr_wid   0     0)       //0
    ($dia         0     0)       //1
    ($dia         $conv 0)       //2
    ($snctr_wid   $conv 0)       //3
    ($snctr_wid   0     0.005)   //4
    ($dia         0     0.005)   //5
    ($dia         $conv 0.005)   //6
    ($snctr_wid   $conv 0.005)   //7
    //2
    (0            0     0)       //8
    (0            $conv 0)       //9
    (0            0     0.005)   //10
    (0            $conv 0.005)   //11
//Mid-Block
    ($snctr_wid   $cond 0)       //12
    ($dia         $cond 0)       //13
    ($snctr_wid   $cond 0.005)   //14
    ($dia         $cond 0.005)   //15
    //2
    (0            $cond 0)       //16
    (0            $cond 0.005)   //17
//Upper-Block
    ($snctr_wid   $htop_snctr 0)      //18
    ($dia         $htop_snctr 0)      //19
    ($snctr_wid   $htop_snctr 0.005)  //20
    ($dia         $htop_snctr 0.005)  //21
    //2
    (0            $htop_snctr 0)      //22
    (0            $htop_snctr 0.005)  //23
//Upper-Block (beside-sonicator)
    ($snctr_wid   $ht  0)           //24
    ($dia         $ht  0)           //25
    ($snctr_wid   $ht  0.005)       //26
    ($dia         $ht  0.005)       //27
);

blocks
(
    hex (0 1 2 3 4 5 6 7)           (18 80 1) simpleGrading (1 1 1)
    hex (8 0 3 9 10 4 7 11)         (1  80 1) simpleGrading (1 1 1)
    hex (3 2 13 12 7 6 15 14)       (18 20 1) simpleGrading (1 1 1)
    hex (9 3 12 16 11 7 14 17)      (1  20 1) simpleGrading (1 1 1)
    hex (12 13 19 18 14 15 21 20)   (18 8 1) simpleGrading (1 1 1)
    hex (16 12 18 22 17 14 20 23)   (1  8 1) simpleGrading (1 1 1)
    hex (18 19 25 24 20 21 27 26)   (18 12 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    Top
    {
        type patch;
        faces
        (
            (24 26 27 25)
        );
    }
    snctr
    {
        type patch;
        faces
        (
            (18 20 26 24)
            (22 23 20 18)
        );
    }
    Bottom
    {
        type patch;
        faces
        (
            (1 5 4 0)
            (0 4 10 8)
        );
    }
    htopWall
    {
      type wall;
      faces
      (
        (25 27 21 19)
        (19 21 15 13)
      );
    }
    condWall
    {
        type wall;
        faces
        (
          (13 15 6 2)
        );
    }
    convWall
    {
        type wall;
        faces
        (
          (2 6 5 1)
        );
    }
    LSymm
    {
        type symmetryPlane;
        faces
        (
            (8 10 11 9)
            (9 11 17 16)
            (16 17 23 22)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)

            (8 9 3 0)
            (10 4 7 11)

            (9 16 12 3)
            (11 7 14 17)

            (3 12 13 2)
            (7 6 15 14)

            (12 18 19 13)
            (14 15 21 20)

            (16 22 18 12)
            (17 14 20 23)

            (18 24 25 19)
            (20 21 27 26)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
